# https://qiita.com/miler0528/items/09f08f06a7b39fb90700
# https://datawokagaku.com/python_t_test/

from scipy import stats

a = [0.166666667
,0.172222222
,0.139074074
,0.137969136
,0.171265638
,0.172375521
,0.139079184
,0.171302639
,0.205710088
,0.240190336
,0.274673011
]

b = [0.275822434
,0.309194081
,0.343639803
,0.344787993
,0.344826266
,0.311494209
,0.31038314
,0.310346105
,0.343678203
,0.378122607
,0.412604087
]

print(stats.ttest_rel(a, b, alternative='two-sided'))

'''
片側：Ttest_relResult(statistic=-16.532919778992966, pvalue=6.83970597010477e-09)   // statistic->t, pvalue->P片側
両側：Ttest_relResult(statistic=-16.532919778992966, pvalue=1.367941194020954e-08)

今回は両側を使う
pvalueが0.05以下なら(両端の部分に入るなら)有意差は認められる
pvalue < 0.05となっているので有意差は認められる

有意差が認められる->平常時と刺激時で感情に差異がある

'''
